README.org
#+TITLE:    Using of voltron
#+AUTHOR:   Olexandr Sydorchuk
#+EMAIL:    olexandr_syd [at] users.sourceforge.net
#+STARTUP:  showall

* Overview

  Voltron is generator of chatmenu for different HUDs of several games
  (primary for tremulous and [[http://tremulous.net/forum/index.php?topic=8699.0][Volt  HUD]] [fn:1]). Also allow you add own
  binds into config  file, create message list and  auto split file if
  need.

** Basic Usage:
   You need  to have  tcl to use  voltron. Created configure  file you
   must pass to voltron:

  #+begin_example
%tclsh voltron.tcl yourconfig
  #+end_example

   You can  use sample  configure file [[http://github.com/osv/voltron/blob/master/volt.config.tcl.sample][volt.config.tcl.sample]]  as your
   base configure file.

