README.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>

<title>Using of voltron</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-09-30 20:06:36 UTC"/>
<meta name="author" content="Olexandr Sydorchuk"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">
<h1 class="title">Using of voltron</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Overview </a>
<ul>
<li><a href="#sec-1.1">1.1 Basic Usage: </a></li>
</ul>
</li>
<li><a href="#sec-2">2 Creating chat menu </a>
<ul>
<li><a href="#sec-2.1">2.1 Customising </a>
<ul>
<li><a href="#sec-2.1.1">2.1.1 <code>bind_keys</code> </a></li>
<li><a href="#sec-2.1.2">2.1.2 <code>chatmenu_teama</code> </a></li>
<li><a href="#sec-2.1.3">2.1.3 <code>chatmenu_teamb</code> </a></li>
<li><a href="#sec-2.1.4">2.1.4 <code>chatmenu_spect</code> </a></li>
<li><a href="#sec-2.1.5">2.1.5 <code>chatmenu_install</code> </a></li>
<li><a href="#sec-2.1.6">2.1.6 <code>binds_teama_install</code> </a></li>
<li><a href="#sec-2.1.7">2.1.7 <code>binds_teamb_install</code> </a></li>
<li><a href="#sec-2.1.8">2.1.8 <code>binds_spect_install</code> </a></li>
<li><a href="#sec-2.1.9">2.1.9 Template for menu </a></li>
<li><a href="#sec-2.1.10">2.1.10 <code>backspace_cmd</code> </a></li>
<li><a href="#sec-2.1.11">2.1.11 <code>fileSplitSize</code> </a></li>
<li><a href="#sec-2.1.12">2.1.12 unbind </a></li>
<li><a href="#sec-2.1.13">2.1.13 unbindTeams </a></li>
<li><a href="#sec-2.1.14">2.1.14 bind </a></li>
<li><a href="#sec-2.1.15">2.1.15 bindTeams </a></li>
<li><a href="#sec-2.1.16">2.1.16 <code>postInstall</code> </a></li>
<li><a href="#sec-2.1.17">2.1.17 messages-from-file </a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Overview </h2>
<div class="outline-text-2" id="text-1">


<p>
Voltron is generator of chatmenu for different HUDs of several games
(primary for tremulous and <a href="http://tremulous.net/forum/index.php?topic=8699.0">Volt  HUD</a> <sup><a class="footref" name="fnr.1" href="#fn.1">1</a></sup>). Also allow you add own
binds into config  file, create message list and  auto split file if
need.
</p>

</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> Basic Usage: </h3>
<div class="outline-text-3" id="text-1.1">

<p>You need  to have  tcl to use  voltron. Created configure  file you
must pass to voltron:
</p>



<pre class="example">%tclsh voltron.tcl yourconfig
</pre>




<p>
You can  use sample  configure file <a href="http://github.com/osv/voltron/blob/master/volt.config.tcl.sample">volt.config.tcl.sample</a>  as your
base configure file.
</p>
</div>
</div>

</div>
