README.org
* Creating chat menu
  Configure file is  [[http://www.tcl.tk][tcl]] source file. But don't  worry, you don't need
  to learn this language for creating your menus.  Below is example of
  simple menu:

#+begin_src tcl -n -r
set snd_menuoff sound/misc/menu3
set snd_menuon  sound/misc/menu1.wav

set 1. {
    {}			{play $snd_menuon}      (ref:all1)
    {Evolve "Evolve to:"} {}			(ref:evolve) (ref:ali1)
    {Buy "Buy:"} {}				(ref:hum1)
    {} {}					(ref:spec1)
}
set 1.1. {  
    ""			{play $snd_menuoff}
    "Dretch"		{class level0}
    "Construction Kit"	{sell weapons;sell upgrades;buy ackit; buy ckit;itemact ackit;itemact ckit}
}
set 1.2. {
    ""			{play $snd_menuoff}
    Basilisk		{class level1}
    Rifle		{sell weapons;sell weapons;buy rifle;itemact rifle}
}
#+end_src

  If you save this sample and run voltron to produce menu:

  #+begin_example
%tclsh voltron.tcl yourconfig
==> Generate menu:
Hud file: chatmenu_alien.cfg
Hud file: chatmenu_human.cfg
Hud file: chatmenu_spec.cfg
==> Generate exec scripts:
EXEC script for all: chatmenu_install.cfg
EXEC script team a: chatmenu_alien_install.cfg
EXEC script team b: chatmenu_human_install.cfg
EXEC script team s: chatmenu_spect_install.cfg
%
  #+end_example

  After you must copy (if you not set [[vars][variables]] in your configure file
  before) created files in =ui/hud/common= for example.  *If you don't
  use volt  HUD* then  you must include  all =chatmenu_*.cfg=  in your
  .menu file,  and do exec command  for one of  *install.cfg files. It
  create next menus for different teams:

| menu   | team A (aliens) | team B (humans)     | Spectator |
| /      | <               | <                   | <         |
|--------+-----------------+---------------------+-----------|
| root   | Sub Menus:      | Sub Menus:          |           |
|        | 1. Evolve       | 1. Buy              |           |
|--------+-----------------+---------------------+-----------|
| menu 1 | Evolve to:      | Buy:                |           |
|        | 1. Dretch       | 1. Construction Kit |           |
|        | 2. Basilisk     | 2. rifle            |           |

  Full syntax of menu is: 

  #+begin_example -r
 set X. {							(ref:root)
     {MenuTextForAll MenuHeaderForAll}	CommandForAll	        (ref:cmd4all)
     {MenuAlienText MenuHeaderForAlien}	AlienCommands           (ref:cmd4ali)
     {MenuHumText MenuHeaderForHuman}	HumCommands             (ref:cmd4hum)
     {MenuSpecText MenuHeaderForSpec}	SpectatorCommands       (ref:cmd4spec)
 }

 set X.Y. {
     MenuTextForAll	CommandForAll
     MenuAlienText	AlienCommands
     MenuHumText	HumCommands
     MenuSpecText	SpectatorCommands
 }
  #+end_example
  
  Here is  list of  4 pairs:  [[(cmd4all)][all]], [[(cmd4ali)][team a]]  (aliens), [[(cmd4hum)][team  b]] (humans),
  [[(cmd4spec)][spectator]].  First  element of  pair is name  of menu item,  second -
  command for  it.  If its  a [[(root)]] menu  item than first  element is
  pair of name  of menu item and header name  of child submenu. Values
  of pair =all= is joined to other pairs.

  You can take different menu action for different teams, but you need
  to load  that config files in  some way. Voltron  generate 4 install
  files:
  
 - =chatmenu_install.cfg=  - it contain  merged action for  all teams.
   You can load him if you  have no conflict commands. For example you
   have no several  "say" command for different teams  (i.e. you setup
   only =CommandForAll=).
 - =chatmenu_alien_install.cfg=  - aliens specified  commands, you may
   need load him when you _join_ to team;
 - =chatmenu_human_install.cfg= - humans specified commands, you may
   need load him when you _join_ to team;
 - =chatmenu_spect_install.cfg= - spectate specified commands, you may
   need load him when you _join_ to team;

  Example of usage =chatmenu_*_install.cfg= files is below:

#+begin_src tcl
set snd_menuoff sound/misc/menu3
set snd_menuon  sound/misc/menu1.wav
# menu example
set 0. {{Join "Join:"}			{play $snd_menuon} }
set 0.1. {"Joint alien"			{team aliens;exec ui/hud/common/chatmenu_alien_install.cfg;play $snd_menuoff}}
set 0.2. {"Joint human"			{team humans;exec ui/hud/common/chatmenu_human_install.cfg;play $snd_menuoff}}
set 0.3. {"Joint spectate"		{team spectate;exec ui/hud/common/chatmenu_spect_install.cfg;play $snd_menuoff}}
# bind example, select spectate team
bind F9 "team spectate; exec ui/hud/common/chatmenu_spect_install.cfg"
#+end_src

** Customising
   You can use several variables and commands  for configuring.
*** =bind_keys=
    Keys for menu, default is {1 2 3 4 5 6 7 8 9 0 - =}.

# <<vars>>
*** =chatmenu_teama=
    Chat menu output file name  for team A.  Default is =chatmenu_alien.cfg=.

*** =chatmenu_teamb=
    Chat menu output file name for team B.  Default is =chatmenu_human.cfg=.

*** =chatmenu_spect=
    Chat menu output file name for spectator. Default is =chatmenu_spec.cfg=.

*** =chatmenu_install=
    Main chat menu install script that contain all merged binds for all
    teams.  Default is =chatmenu_install.cfg=.

