README.html

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Creating chat menu </h2>
<div class="outline-text-2" id="text-2">

<p>Configure file is  <a href="http://www.tcl.tk">tcl</a> source file. But don't  worry, you don't need
to learn this language for creating your menus.  Below is example of
simple menu:
</p>



<pre class="src src-tcl"><span class="linenr"> 1:  </span><span style="color: #da70d6;">set</span> <span style="color: #b8860b;">snd_menuoff</span> sound/misc/menu3
<span class="linenr"> 2:  </span><span style="color: #da70d6;">set</span> <span style="color: #b8860b;">snd_menuon</span>  sound/misc/menu1.wav
<span class="linenr"> 3:  </span>
<span class="linenr"> 4:  </span><span style="color: #da70d6;">set</span> <span style="color: #b8860b;">1</span>. {
<span id="coderef-all1" class="coderef-off"><span class="linenr"> 5:  </span>    {}                  {play $<span style="color: #b8860b;">snd_menuon</span>}</span>
<span id="coderef-evolve" class="coderef-off"><span class="linenr"> 6:  </span>    {Evolve <span style="color: #bc8f8f;">"Evolve to:"</span>} {} (ref:ali1)</span>
<span id="coderef-hum1" class="coderef-off"><span class="linenr"> 7:  </span>    {Buy <span style="color: #bc8f8f;">"Buy:"</span>} {}</span>
<span id="coderef-spec1" class="coderef-off"><span class="linenr"> 8:  </span>    {} {}</span>
<span class="linenr"> 9:  </span>}
<span class="linenr">10:  </span><span style="color: #da70d6;">set</span> <span style="color: #b8860b;">1</span>.1. {  
<span class="linenr">11:  </span>    <span style="color: #bc8f8f;">""</span>                  {play $<span style="color: #b8860b;">snd_menuoff</span>}
<span class="linenr">12:  </span>    <span style="color: #bc8f8f;">"Dretch"</span>            {<span style="color: #a020f0; font-weight: bold;">class</span> level0}
<span class="linenr">13:  </span>    <span style="color: #bc8f8f;">"Construction Kit"</span>  {sell weapons;sell upgrades;buy ackit; buy ckit;itemact ackit;itemact ckit}
<span class="linenr">14:  </span>}
<span class="linenr">15:  </span><span style="color: #da70d6;">set</span> <span style="color: #b8860b;">1</span>.2. {
<span class="linenr">16:  </span>    <span style="color: #bc8f8f;">""</span>                  {play $<span style="color: #b8860b;">snd_menuoff</span>}
<span class="linenr">17:  </span>    Basilisk            {<span style="color: #a020f0; font-weight: bold;">class</span> level1}
<span class="linenr">18:  </span>    Rifle               {sell weapons;sell weapons;buy rifle;itemact rifle}
<span class="linenr">19:  </span>}
</pre>




<p>
If you save this sample and run voltron to produce menu:
</p>



<pre class="example">%tclsh voltron.tcl yourconfig
==&gt; Generate menu:
Hud file: chatmenu_alien.cfg
Hud file: chatmenu_human.cfg
Hud file: chatmenu_spec.cfg
==&gt; Generate exec scripts:
EXEC script for all: chatmenu_install.cfg
EXEC script team a: chatmenu_alien_install.cfg
EXEC script team b: chatmenu_human_install.cfg
EXEC script team s: chatmenu_spect_install.cfg
%
</pre>




<p>
After you must copy (if you not set <a href="#sec-2.1.2">variables</a> in your configure file
before) created files in <code>ui/hud/common</code> for example.  <b>If you don't   use volt  HUD</b> then  you must include  all <code>chatmenu_*.cfg</code>  in your
.menu file,  and do exec command  for one of  *install.cfg files. It
create next menus for different teams:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /></colgroup>
<colgroup><col align="left" /></colgroup>
<colgroup><col align="left" /></colgroup>
<colgroup><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">menu</th><th scope="col">team A (aliens)</th><th scope="col">team B (humans)</th><th scope="col">Spectator</th></tr>
</thead>
<tbody>
<tr><td>root</td><td>Sub Menus:</td><td>Sub Menus:</td><td></td></tr>
<tr><td></td><td>1. Evolve</td><td>1. Buy</td><td></td></tr>
</tbody>
<tbody>
<tr><td>menu 1</td><td>Evolve to:</td><td>Buy:</td><td></td></tr>
<tr><td></td><td>1. Dretch</td><td>1. Construction Kit</td><td></td></tr>
<tr><td></td><td>2. Basilisk</td><td>2. rifle</td><td></td></tr>
</tbody>
</table>


<p>
Full syntax of menu is: 
</p>



<pre class="example"><span id="coderef-root" class="coderef-off">set X. {</span>
<span id="coderef-cmd4all" class="coderef-off">    {MenuTextForAll MenuHeaderForAll}  CommandForAll</span>
<span id="coderef-cmd4ali" class="coderef-off">    {MenuAlienText MenuHeaderForAlien} AlienCommands</span>
<span id="coderef-cmd4hum" class="coderef-off">    {MenuHumText MenuHeaderForHuman}   HumCommands</span>
<span id="coderef-cmd4spec" class="coderef-off">    {MenuSpecText MenuHeaderForSpec}   SpectatorCommands</span>
}

set X.Y. {
    MenuTextForAll     CommandForAll
    MenuAlienText      AlienCommands
    MenuHumText        HumCommands
    MenuSpecText       SpectatorCommands
}
</pre>




<p>
Here is  list of  4 pairs:  <a href="#coderef-cmd4all" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-cmd4all');" onmouseout="CodeHighlightOff(this, 'coderef-cmd4all');">all</a>, <a href="#coderef-cmd4ali" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-cmd4ali');" onmouseout="CodeHighlightOff(this, 'coderef-cmd4ali');">team a</a>  (aliens), <a href="#coderef-cmd4hum" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-cmd4hum');" onmouseout="CodeHighlightOff(this, 'coderef-cmd4hum');">team  b</a> (humans),
<a href="#coderef-cmd4spec" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-cmd4spec');" onmouseout="CodeHighlightOff(this, 'coderef-cmd4spec');">spectator</a>.  First  element of  pair is name  of menu item,  second -
command for  it.  If its  a <a href="#coderef-root" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-root');" onmouseout="CodeHighlightOff(this, 'coderef-root');">root</a> menu  item than first  element is
pair of name  of menu item and header name  of child submenu. Values
of pair <code>all</code> is joined to other pairs.
</p>
<p>
You can take different menu action for different teams, but you need
to load  that config files in  some way. Voltron  generate 4 install
files:
</p>
<ul>
<li>
<code>chatmenu_install.cfg</code>  - it contain  merged action for  all teams.
You can load him if you  have no conflict commands. For example you
have no several  "say" command for different teams  (i.e. you setup
only <code>CommandForAll</code>).
</li>
<li>
<code>chatmenu_alien_install.cfg</code>  - aliens specified  commands, you may
need load him when you <span style="text-decoration:underline;">join</span> to team;
</li>
<li>
<code>chatmenu_human_install.cfg</code> - humans specified commands, you may
need load him when you <span style="text-decoration:underline;">join</span> to team;
</li>
<li>
<code>chatmenu_spect_install.cfg</code> - spectate specified commands, you may
need load him when you <span style="text-decoration:underline;">join</span> to team;

<p>
Example of usage <code>chatmenu_*_install.cfg</code> files is below:
</p>

</li>
</ul>


<pre class="src src-tcl"><span style="color: #da70d6;">set</span> <span style="color: #b8860b;">snd_menuoff</span> sound/misc/menu3
<span style="color: #da70d6;">set</span> <span style="color: #b8860b;">snd_menuon</span>  sound/misc/menu1.wav
<span style="color: #888888;"># </span><span style="color: #b22222; font-style: italic;">menu example
</span><span style="color: #da70d6;">set</span> <span style="color: #b8860b;">0</span>. {{Join <span style="color: #bc8f8f;">"Join:"</span>}                  {play $<span style="color: #b8860b;">snd_menuon</span>} }
<span style="color: #da70d6;">set</span> <span style="color: #b8860b;">0</span>.1. {<span style="color: #bc8f8f;">"Joint alien"</span>                 {team aliens;<span style="color: #da70d6;">exec</span> ui/hud/common/chatmenu_alien_install.cfg;play $<span style="color: #b8860b;">snd_menuoff</span>}}
<span style="color: #da70d6;">set</span> <span style="color: #b8860b;">0</span>.2. {<span style="color: #bc8f8f;">"Joint human"</span>                 {team humans;<span style="color: #da70d6;">exec</span> ui/hud/common/chatmenu_human_install.cfg;play $<span style="color: #b8860b;">snd_menuoff</span>}}
<span style="color: #da70d6;">set</span> <span style="color: #b8860b;">0</span>.3. {<span style="color: #bc8f8f;">"Joint spectate"</span>              {team spectate;<span style="color: #da70d6;">exec</span> ui/hud/common/chatmenu_spect_install.cfg;play $<span style="color: #b8860b;">snd_menuoff</span>}}
<span style="color: #888888;"># </span><span style="color: #b22222; font-style: italic;">bind example, select spectate team
</span>bind F9 <span style="color: #bc8f8f;">"team spectate; exec ui/hud/common/chatmenu_spect_install.cfg"</span>
</pre>





</div>

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1"><span class="section-number-3">2.1</span> Customising </h3>
<div class="outline-text-3" id="text-2.1">

<p>You can use several variables and commands for configuring.
</p>
</div>

<div id="outline-container-2.1.1" class="outline-4">
<h4 id="sec-2.1.1"><span class="section-number-4">2.1.1</span> <code>bind_keys</code> </h4>
<div class="outline-text-4" id="text-2.1.1">

<p>Keys for menu, default is {1 2 3 4 5 6 7 8 9 0 - =}.
</p>
</div>

</div>

<div id="outline-container-2.1.2" class="outline-4">
<h4 id="sec-2.1.2"><a name="vars" id="vars"></a><span class="section-number-4">2.1.2</span> <code>chatmenu_teama</code> </h4>
<div class="outline-text-4" id="text-2.1.2">

<p>Chat menu output file name  for team A.  Default is <code>chatmenu_alien.cfg</code>.
</p>
</div>

</div>

<div id="outline-container-2.1.3" class="outline-4">
<h4 id="sec-2.1.3"><span class="section-number-4">2.1.3</span> <code>chatmenu_teamb</code> </h4>
<div class="outline-text-4" id="text-2.1.3">

<p>Chat menu output file name for team B.  Default is <code>chatmenu_human.cfg</code>.
</p>
</div>

</div>

<div id="outline-container-2.1.4" class="outline-4">
<h4 id="sec-2.1.4"><span class="section-number-4">2.1.4</span> <code>chatmenu_spect</code> </h4>
<div class="outline-text-4" id="text-2.1.4">

<p>Chat menu output file name for spectator. Default is <code>chatmenu_spec.cfg</code>.
</p>
</div>

</div>

<div id="outline-container-2.1.5" class="outline-4">
<h4 id="sec-2.1.5"><span class="section-number-4">2.1.5</span> <code>chatmenu_install</code> </h4>
<div class="outline-text-4" id="text-2.1.5">

<p>Main chat menu install script that contain all merged binds for all
teams.  Default is <code>chatmenu_install.cfg</code>.
</p>
</div>

</div>
