README.org
*** =binds_teama_install=
    Script   file  for   binds   of  team   A   (aliens).  Default   is
    =chatmenu_alien_install.cfg=.

*** =binds_teamb_install=
    Script   file  for   binds   of  team   B   (humans).  Default   is
    =chatmenu_human_install.cfg=)

*** =binds_spect_install=
    Script    file    for    binds    of    spectator.    Default    is
    =chatmenu_spect_install.cfg=)

*** Template for menu
   You may set menu template different for all teams:
   - =menu_alien_tmpl=;
   - =menu_human_tmpl=;
   - =menu_spectator_tmpl=.

   Default is:

#+begin_src tcl
set menu_spectator_tmpl "    rect 6 210 400 190
    visible 1
    decoration
    forecolor 45 45 45 1
    textscale 0.25
    autowrapped
    textstyle ITEM_TEXTSTYLE_SHADOWED"
#+end_src

*** =backspace_cmd=
    additional command  for BACKSPACE key (primary command  is set root
    menu).  Default =play sound/misc/menu4.wav=

*** =fileSplitSize=
   Max file size before split. Quake  have limits for cfg file size in
   16k.   To prevent  fail load  file will  be split  and  used =exec=
   command.

#<<bind>>
*** bind 
   =bind= add additional key bind  at end of install script, it similar
   to quake bind.

*** bindTeams
   =bindTeams= is  quake bind command,  but team specified  bind. Like
   menu  you  can  load  different  =*_install.cfg=  config  file  for
   different teams, and  all binds with this command  will be only for
   one of team. Format of command:

#+begin_example
bindTeams key {
     commandForAll
     commandForTeamA
     commandForTeamB
     commandForTeamSpec
 }
#+end_example

   Example: bind INSERT key to  spawn as *(Adv)graner* if you in [[(btalien)][alien]]
   team or spawn as *human* *builder* and take ckit if you are [[(bthuman)][human]]:

#+begin_src tcl -r
set snd_menuoff "sound/misc/menu3"

bindTeams INS {
    {echo ^1Spawn as builder;play $snd_menuoff}
    {class builderupg;class builder}									(ref:btalien)
    {class ackit; class ckit;sell weapons;sell upgrades;buy ackit; buy ckit;itemact ackit;itemact ckit} (ref:bthuman)
    {echo ^1You are spectate}
}
#+end_src

*** postInstall
   Text of install script that be at and. Default is volt's binds like
   sound control etc. You can easy add some stuff:

#+begin_src tcl
set postInstall "$postInstall
// some addition stuf
unbind v
exec foobaar.cfg"
#+end_src
 
*** =messages-from-file=
   Create  messages  list  that  allow  you cyclic  run  some  command
   (default is "say" command).  Format of command:

   =messages-from-file variable_name file_source file_dest execpath {prefix {}} {sufix {}} {command {"say"}}=

   -  =variable_name=  is  quake  var  that  you  can  use  by  =vstr
     variable_name= (good to bind some key to it);
   - =file_source= - source file  of lines, file also will be searched
     in directory where configure file is located;
   - =file_dest= - generated configfile location;
   - =execpath= - quakebased path to file;
   - =prefix=,  =sufix= -  text that be  concatenate before  and after
     each line of text file;
   - =command= - action to each line of text file (default =say=);

   For example you wish to say different "hello". You have file =hello.txt=:

#+begin_src tcl
# comment is line that start with #
Hi
Hello
Hola
#+end_src

  In your config you can add:

#+begin_src tcl
messages-from-file Hello \
    "hello.txt"\
    "~/.tremulous/base/ui/hud/common/msg/hello.cfg" \
    ui/hud/common/msg/alienjoin.cfg \
    \o/(  ) say
# bind it to menu 9.9
set 9. {{Messages "Messages:"}	{play sound/misc/menu1.wav} }
set 9.9. { {} {}
    "Hello"  "vstr Hello"
}
#+end_src

* Footnotes

[fn:1]  It configured by  default for  creating =chatmenu_install.cfg=
which is  a part of volts's  chatmenu, who is initial  creator of this
chat menu i don't know, but you can inform me :).
