README.html

<div id="outline-container-2.1.6" class="outline-4">
<h4 id="sec-2.1.6"><span class="section-number-4">2.1.6</span> <code>binds_teama_install</code> </h4>
<div class="outline-text-4" id="text-2.1.6">

<p>Script   file  for   binds   of  team   A   (aliens).  Default   is
<code>chatmenu_alien_install.cfg</code>.
</p>
</div>

</div>

<div id="outline-container-2.1.7" class="outline-4">
<h4 id="sec-2.1.7"><span class="section-number-4">2.1.7</span> <code>binds_teamb_install</code> </h4>
<div class="outline-text-4" id="text-2.1.7">

<p>Script   file  for   binds   of  team   B   (humans).  Default   is
<code>chatmenu_human_install.cfg</code>)
</p>
</div>

</div>

<div id="outline-container-2.1.8" class="outline-4">
<h4 id="sec-2.1.8"><span class="section-number-4">2.1.8</span> <code>binds_spect_install</code> </h4>
<div class="outline-text-4" id="text-2.1.8">

<p>Script    file    for    binds    of    spectator.    Default    is
<code>chatmenu_spect_install.cfg</code>)
</p>
</div>

</div>

<div id="outline-container-2.1.9" class="outline-4">
<h4 id="sec-2.1.9"><span class="section-number-4">2.1.9</span> Template for menu </h4>
<div class="outline-text-4" id="text-2.1.9">

<p>You may set menu template different for all teams:
</p><ul>
<li>
<code>menu_alien_tmpl</code>;
</li>
<li>
<code>menu_human_tmpl</code>;
</li>
<li>
<code>menu_spectator_tmpl</code>.

</li>
</ul>

<p>Default is:
</p>



<pre class="src src-tcl"><span style="color: #da70d6;">set</span> <span style="color: #b8860b;">menu_spectator_tmpl</span> <span style="color: #bc8f8f;">"    rect 6 210 400 190
    visible 1
    decoration
    forecolor 45 45 45 1
    textscale 0.25
    autowrapped
    textstyle ITEM_TEXTSTYLE_SHADOWED"</span>
</pre>




</div>

</div>

<div id="outline-container-2.1.10" class="outline-4">
<h4 id="sec-2.1.10"><span class="section-number-4">2.1.10</span> <code>backspace_cmd</code> </h4>
<div class="outline-text-4" id="text-2.1.10">

<p>additional command for BACKSPACE  key (primary command is set root
menu).  Default <code>play sound/misc/menu4.wav</code>
</p>
</div>

</div>

<div id="outline-container-2.1.11" class="outline-4">
<h4 id="sec-2.1.11"><span class="section-number-4">2.1.11</span> <code>fileSplitSize</code> </h4>
<div class="outline-text-4" id="text-2.1.11">

<p>Max file size before split. Quake have limits for cfg file size in
16k.   To prevent fail  load file  will be  split and  used <code>exec</code>
command.
</p>
</div>

</div>

<div id="outline-container-2.1.12" class="outline-4">
<h4 id="sec-2.1.12"><span class="section-number-4">2.1.12</span> unbind </h4>
<div class="outline-text-4" id="text-2.1.12">

<p>Quake like  unbind command. This  command have lower  prioritet vs
bind command.
</p>
</div>

</div>

<div id="outline-container-2.1.13" class="outline-4">
<h4 id="sec-2.1.13"><span class="section-number-4">2.1.13</span> unbindTeams </h4>
<div class="outline-text-4" id="text-2.1.13">

<p>Team specified unbind command. Format of command:
</p>



<pre class="example">unbindTeams key team_list
</pre>




<p>
Where <code>team_list</code> is list of:
</p><ul>
<li>
<code>ali</code>, <code>alien</code>, <code>a</code>, <code>1</code> &ndash; alien team (team a)
</li>
<li>
<code>hum</code>, <code>human, =b</code>, <code>2</code> &ndash; human team (team b)
</li>
<li>
<code>spec</code>, <code>spectator</code>, <code>3</code> &ndash; spectator team

</li>
</ul>

<p>Example:
</p>



<pre class="example">unbindTeams v {hum ali}
</pre>





</div>

</div>

<div id="outline-container-2.1.14" class="outline-4">
<h4 id="sec-2.1.14"><a name="bind" id="bind"></a><span class="section-number-4">2.1.14</span> bind </h4>
<div class="outline-text-4" id="text-2.1.14">

<p><code>bind</code>  add additional  key  bind  at end  of  install script,  it
similar to quake bind.
</p>
</div>

</div>

<div id="outline-container-2.1.15" class="outline-4">
<h4 id="sec-2.1.15"><span class="section-number-4">2.1.15</span> bindTeams </h4>
<div class="outline-text-4" id="text-2.1.15">

<p><code>bindTeams</code> is  quake bind command, but team  specified bind. Like
menu  you  can  load  different <code>*_install.cfg</code>  config  file  for
different teams, and all binds  with this command will be only for
one of team. Format of command:
</p>



<pre class="example">bindTeams key {
     commandForAll
     commandForTeamA
     commandForTeamB
     commandForTeamSpec
 }
</pre>




<p>
Example: bind INSERT key to spawn as <b>(Adv)graner</b> if you in <a href="#coderef-btalien" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-btalien');" onmouseout="CodeHighlightOff(this, 'coderef-btalien');">alien</a>
team or spawn as <b>human</b> <b>builder</b> and take ckit if you are <a href="#coderef-bthuman" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-bthuman');" onmouseout="CodeHighlightOff(this, 'coderef-bthuman');">human</a>:
</p>



<pre class="src src-tcl"><span style="color: #da70d6;">set</span> <span style="color: #b8860b;">snd_menuoff</span> <span style="color: #bc8f8f;">"sound/misc/menu3"</span>

bindTeams INS {
    {echo ^1Spawn as builder;play $<span style="color: #b8860b;">snd_menuoff</span>}
<span id="coderef-btalien" class="coderef-off">    {<span style="color: #a020f0; font-weight: bold;">class</span> builderupg;<span style="color: #a020f0; font-weight: bold;">class</span> builder}</span>
<span id="coderef-bthuman" class="coderef-off">    {<span style="color: #a020f0; font-weight: bold;">class</span> ackit; <span style="color: #a020f0; font-weight: bold;">class</span> ckit;sell weapons;sell upgrades;buy ackit; buy ckit;itemact ackit;itemact ckit}</span>
    {echo ^1You are spectate}
}
</pre>




</div>

</div>

<div id="outline-container-2.1.16" class="outline-4">
<h4 id="sec-2.1.16"><span class="section-number-4">2.1.16</span> <code>postInstall</code> </h4>
<div class="outline-text-4" id="text-2.1.16">

<p>Text of  install script  that be at  and. Default is  volt's binds
like sound control etc. You can easy add some stuff:
</p>



<pre class="src src-tcl"><span style="color: #da70d6;">set</span> <span style="color: #b8860b;">postInstall</span> <span style="color: #bc8f8f;">"$postInstall
// some addition stuf
unbind v
exec foobaar.cfg"</span>
</pre>




</div>

</div>

<div id="outline-container-2.1.17" class="outline-4">
<h4 id="sec-2.1.17"><span class="section-number-4">2.1.17</span> messages-from-file </h4>
<div class="outline-text-4" id="text-2.1.17">

<p>Create  messages  list  that  allow  you cyclic  run  some  command
(default is "say" command).  Format of command:
</p>
<p>
<code>messages-from-file variable_name file_source file_dest execpath {prefix {}} {sufix {}} {command {"say"}}</code>
</p>
<ul>
<li>
 <code>variable_name</code>  is  quake  var  that  you  can  use  by  <code>vstr        variable_name</code> (good to bind some key to it);
</li>
<li>
<code>file_source</code> - source file  of lines, file also will be searched
in directory where configure file is located;
</li>
<li>
<code>file_dest</code> - generated configfile location;
</li>
<li>
<code>execpath</code> - quakebased path to file;
</li>
<li>
<code>prefix</code>,  <code>sufix</code> -  text that be  concatenate before  and after
each line of text file;
</li>
<li>
<code>command</code> - action to each line of text file (default <code>say</code>);

</li>
</ul>

<p>For example you wish to say different "hello". You have file <code>hello.txt</code>:
</p>



<pre class="src src-tcl"><span style="color: #888888;"># </span><span style="color: #b22222; font-style: italic;">comment is line that start with #
</span>Hi
Hello
Hola
</pre>




<p>
In your config you can add:
</p>



<pre class="src src-tcl">messages-from-file Hello <span style="color: #bc8f8f;">\</span>
    <span style="color: #bc8f8f;">"hello.txt"</span><span style="color: #bc8f8f;">\</span>
    <span style="color: #bc8f8f;">"~/.tremulous/base/ui/hud/common/msg/hello.cfg"</span> <span style="color: #bc8f8f;">\</span>
    ui/hud/common/msg/alienjoin.cfg <span style="color: #bc8f8f;">\</span>
    \o/(  ) say
<span style="color: #888888;"># </span><span style="color: #b22222; font-style: italic;">bind it to menu 9.9
</span><span style="color: #da70d6;">set</span> <span style="color: #b8860b;">9</span>. {{Messages <span style="color: #bc8f8f;">"Messages:"</span>}  {play sound/misc/menu1.wav} }
<span style="color: #da70d6;">set</span> <span style="color: #b8860b;">9</span>.9. { {} {}
    <span style="color: #bc8f8f;">"Hello"</span>  <span style="color: #bc8f8f;">"vstr Hello"</span>
}
</pre>







</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn.1" href="#fnr.1">1</a></sup> It configured by  default for  creating <code>chatmenu_install.cfg</code>
which is  a part of volts's  chatmenu, who is initial  creator of this
chat menu i don't know, but you can inform me :).
</p>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Olexandr Sydorchuk
<a href="mailto:olexandr_syd [at] users.sourceforge.net">&lt;olexandr_syd [at] users.sourceforge.net&gt;</a>
</p>
<p class="date"> Date: 2010-09-30 20:06:36 UTC</p>
<p class="creator">HTML generated by org-mode 6.31trans in emacs 23</p>
</div>
</div>
</body>
</html>
